Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleDiagramFenceType
Defines fence visualization types for diagram settings of analysis display style.
Since:
2012
Since:
2012

Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleDiagramFenceType.ShowPredefined
Show fence only for points that have flag ValueAtPointFlags::DisplayFence

Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleDiagramFenceType.ShowNone
Don't show fence

Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleDiagramFenceType.ShowAll
Show fence for each point